freebsd/freebsd-legacy/usr.sbin/rpctlssd/rpctlssd.8
.\" Copyright (c) 2008 Isilon Inc http://www.isilon.com/
.\" Authors: Doug Rabson <dfr@rabson.org>
.\" Developed with Red Inc: Alfred Perlstein <alfred@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Modified from gssd.8 for rpctlssd.8 by Rick Macklem.
.Dd March 11, 2020
.Dt RPCTLSSD 8
.Os
.Sh NAME
.Nm rpctlssd
.Nd "Sun RPC over TLS Server Daemon"
.Sh SYNOPSIS
.Nm
.Op Fl D Ar certdir
.Op Fl d
.Op Fl h
.Op Fl l Ar CAfile
.Op Fl m
.Op Fl p Ar CApath
.Op Fl r Ar CRLfile
.Op Fl v
.Sh DESCRIPTION
The
.Nm
program provides support for the server side of the kernel Sun RPC over TLS
implementation.
This daemon must be running to allow the kernel RPC to perform the TLS
handshake after a TCP client has sent the STARTTLS Null RPC request to
the server.
This is needed to support clients doing NFS over TLS.
Note that the
.Fl tls
option in the
.Xr exports 5
file specifies that the client must use RPC over TLS and the
.Fl tlscert
option in the
.Xr exports 5
file specifies that the client must provide a certificate
that verifies.
For this latter case, the
.Fl m
and
.Fl l
options must be specified.
.Pp
Also, if the IP address used by the client cannot be trusted,
the rules in
.Xr exports 5
cannot be applied safely.
As such, the
.Fl h
option can be used along with
.Fl m
and
.Fl l
options to require that the client certificate have the correct
Fully Qualified Domain Name in it.
.Pp
A certificate and associated key must exist in /etc/rpctlssd
(or the ``certdir'' specified by the
.Fl D
option)
in files named ``cert.pem'' and ``key.pem''.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl D Ar certdir
Use ``certdir'' instead of /etc/rpctlssd as the location for the
certificate in a file called ``cert.pem'' and key in ``key.pem''.
.It Fl d
Run in debug mode.
In this mode,
.Nm
will not fork when it starts.
.It Fl h
This option specifies that the client must provide a certificate
that both verifies and has the Fully Qualified Domain Name (FQDN) for
the IP address that the client uses to connect to the server
in either the subjectAltName or commonName field of the
certificate.
With this option, a failure to verify the client certificate
or find the FQDN in the certificate will result in the
server sending AUTH_REJECTEDCRED replies to all client RPCs.
This option requires the
.Fl m
and
.Fl l
options.
.It Fl l Ar CAfile
This option specifies the path name of a CA certificate(s) file
in pem format, which is used to verify client certificates and to
set the list of CA(s) sent to the client so that it knows which
certificate to send to the server during the TLS handshake.
This path name is used in
.Dq SSL_CTX_load_verify_locations(ctx,CAfile,NULL)
and
.Dq SSL_CTX_set_client_CA_list(ctx,SSL_load_client_CA_file(CAfile))
openssl calls.
Note that this is a path name for the file and is not assumed to be
in ``certdir''.
This option should be specified when the
.Fl m
option is specified so that the daemon can verify the client's
certificate.
.It Fl m
This option specifies that the server is to request a certificate
from the client during the TLS handshake.
It does not require that the client provide a certificate.
It should be specified unless no client doing RPC over TLS is
required to have a certificate.
For NFS, the export option
.Fl tlscert
will be used to require a client to provide a certificate
that verifies.
.It Fl p Ar CApath
This option is similar to the
.Fl l
option, but specifies the path of a directory with CA
certificates in it.
When this option is used,
.Dq SSL_CTX_set_client_CA_list(ctx,SSL_load_client_CA_file())
is not called, so a list of CA names might not be passed
to the client during the TLS handshake.
(I was not able to determine if/when this matters, but
if in doubt, use the
.Fl l
option instead of this option.)
.It Fl r Ar CRLfile
This option specifies a Certificate Revocation List (CRL) file
that is to be loaded into the verify certificate store and
checked during verification.
This option is meaningless unless either the
.Fl l
or
.Fl p
have been specified.
.It Fl v
Run in verbose mode.
In this mode,
.Nm
will log activity messages to syslog using LOG_INFO | LOG_DAEMON or to
stderr, if the
.Fl d
option has also been specified.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr openssl 1 ,
.Xr syslog 3 ,
.Xr exports 5 ,
.Xr mount_nfs 8 ,
.Xr rpctlscd 8
.Sh BUGS
This daemon cannot be safely shut down and restarted if there are
any active RPC-over-TLS connections.
Doing so will orphan the KERNEL_TLS connections, so that they
can no longer do upcalls successfully, since the
.Dq SSL *
structures in userspace have been lost.
.Sh HISTORY
The
.Nm
manual page first appeared in
.Fx 13.0 .
